app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
---
  def index
    @post = Post.new
    @posts = Post.paginate(:page => params[:page], :per_page => 2)

INSERT INTO `posts` (`content`, `created_at`, `name`, `title`, `updated_at`) VALUES ('content here', '2013-04-08 11:08:25', 'test', 'test', '2013-04-08 11:08:25')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save